driver-tests/bpelse/nmproperty/FromToPropertySpecJBI/test/AddIntProperties/Input.xml

<soapenv:Envelope xsi:schemaLocation="http://schemas.xmlsoap.org/soap/envelope/ http://schemas.xmlsoap.org/soap/envelope/" 
xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" 
xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:con="http://j2ee.netbeans.org/schema/conditionsSchema">
  <soapenv:Body>
    <con:msgElem>
      <intElem>202</intElem>
      <strElem>?string?</strElem>
      <boolElem>?false?</boolElem>
    </con:msgElem>
  </soapenv:Body>
</soapenv:Envelope>